grevaillot/svd_tools/headers/STM32F7x3/can1.h
#define CAN1_TSR_CODE_SHIFT		24
#define CAN1_TSR_CODE_MASK		0x03
/** @defgroup can1_tsr_code CODE CODE
@{*/
/**@}*/

/** CAN1_TSR_ABRQ2 ABRQ2 **/
#define CAN1_TSR_ABRQ2		(1 << 23)
/** CAN1_TSR_TERR2 TERR2 **/
#define CAN1_TSR_TERR2		(1 << 19)
/** CAN1_TSR_ALST2 ALST2 **/
#define CAN1_TSR_ALST2		(1 << 18)
/** CAN1_TSR_TXOK2 TXOK2 **/
#define CAN1_TSR_TXOK2		(1 << 17)
/** CAN1_TSR_RQCP2 RQCP2 **/
#define CAN1_TSR_RQCP2		(1 << 16)
/** CAN1_TSR_ABRQ1 ABRQ1 **/
#define CAN1_TSR_ABRQ1		(1 << 15)
/** CAN1_TSR_TERR1 TERR1 **/
#define CAN1_TSR_TERR1		(1 << 11)
/** CAN1_TSR_ALST1 ALST1 **/
#define CAN1_TSR_ALST1		(1 << 10)
/** CAN1_TSR_TXOK1 TXOK1 **/
#define CAN1_TSR_TXOK1		(1 << 9)
/** CAN1_TSR_RQCP1 RQCP1 **/
#define CAN1_TSR_RQCP1		(1 << 8)
/** CAN1_TSR_ABRQ0 ABRQ0 **/
#define CAN1_TSR_ABRQ0		(1 << 7)
/** CAN1_TSR_TERR0 TERR0 **/
#define CAN1_TSR_TERR0		(1 << 3)
/** CAN1_TSR_ALST0 ALST0 **/
#define CAN1_TSR_ALST0		(1 << 2)
/** CAN1_TSR_TXOK0 TXOK0 **/
#define CAN1_TSR_TXOK0		(1 << 1)
/** CAN1_TSR_RQCP0 RQCP0 **/
#define CAN1_TSR_RQCP0		(1 << 0)

/**@}*/

/** @defgroup can1_rf0r RF0R receive FIFO 0 register
@{*/

/** CAN1_RF0R_RFOM0 RFOM0 **/
#define CAN1_RF0R_RFOM0		(1 << 5)
/** CAN1_RF0R_FOVR0 FOVR0 **/
#define CAN1_RF0R_FOVR0		(1 << 4)
/** CAN1_RF0R_FULL0 FULL0 **/
#define CAN1_RF0R_FULL0		(1 << 3)

#define CAN1_RF0R_FMP0_SHIFT		0
#define CAN1_RF0R_FMP0_MASK		0x03
/** @defgroup can1_rf0r_fmp0 FMP0 FMP0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rf1r RF1R receive FIFO 1 register
@{*/

/** CAN1_RF1R_RFOM1 RFOM1 **/
#define CAN1_RF1R_RFOM1		(1 << 5)
/** CAN1_RF1R_FOVR1 FOVR1 **/
#define CAN1_RF1R_FOVR1		(1 << 4)
/** CAN1_RF1R_FULL1 FULL1 **/
#define CAN1_RF1R_FULL1		(1 << 3)

#define CAN1_RF1R_FMP1_SHIFT		0
#define CAN1_RF1R_FMP1_MASK		0x03
/** @defgroup can1_rf1r_fmp1 FMP1 FMP1
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_ier IER interrupt enable register
@{*/

/** CAN1_IER_SLKIE SLKIE **/
#define CAN1_IER_SLKIE		(1 << 17)
/** CAN1_IER_WKUIE WKUIE **/
#define CAN1_IER_WKUIE		(1 << 16)
/** CAN1_IER_ERRIE ERRIE **/
#define CAN1_IER_ERRIE		(1 << 15)
/** CAN1_IER_LECIE LECIE **/
#define CAN1_IER_LECIE		(1 << 11)
/** CAN1_IER_BOFIE BOFIE **/
#define CAN1_IER_BOFIE		(1 << 10)
/** CAN1_IER_EPVIE EPVIE **/
#define CAN1_IER_EPVIE		(1 << 9)
/** CAN1_IER_EWGIE EWGIE **/
#define CAN1_IER_EWGIE		(1 << 8)
/** CAN1_IER_FOVIE1 FOVIE1 **/
#define CAN1_IER_FOVIE1		(1 << 6)
/** CAN1_IER_FFIE1 FFIE1 **/
#define CAN1_IER_FFIE1		(1 << 5)
/** CAN1_IER_FMPIE1 FMPIE1 **/
#define CAN1_IER_FMPIE1		(1 << 4)
/** CAN1_IER_FOVIE0 FOVIE0 **/
#define CAN1_IER_FOVIE0		(1 << 3)
/** CAN1_IER_FFIE0 FFIE0 **/
#define CAN1_IER_FFIE0		(1 << 2)
/** CAN1_IER_FMPIE0 FMPIE0 **/
#define CAN1_IER_FMPIE0		(1 << 1)
/** CAN1_IER_TMEIE TMEIE **/
#define CAN1_IER_TMEIE		(1 << 0)

/**@}*/

/** @defgroup can1_esr ESR interrupt enable register
@{*/


#define CAN1_ESR_REC_SHIFT		24
#define CAN1_ESR_REC_MASK		0xff
/** @defgroup can1_esr_rec REC REC
@{*/
/**@}*/


#define CAN1_ESR_TEC_SHIFT		16
#define CAN1_ESR_TEC_MASK		0xff
/** @defgroup can1_esr_tec TEC TEC
@{*/
/**@}*/


#define CAN1_ESR_LEC_SHIFT		4
#define CAN1_ESR_LEC_MASK		0x07
/** @defgroup can1_esr_lec LEC LEC
@{*/
/**@}*/

/** CAN1_ESR_BOFF BOFF **/
#define CAN1_ESR_BOFF		(1 << 2)
/** CAN1_ESR_EPVF EPVF **/
#define CAN1_ESR_EPVF		(1 << 1)
/** CAN1_ESR_EWGF EWGF **/
#define CAN1_ESR_EWGF		(1 << 0)

/**@}*/

/** @defgroup can1_btr BTR bit timing register
@{*/

/** CAN1_BTR_SILM SILM **/
#define CAN1_BTR_SILM		(1 << 31)
/** CAN1_BTR_LBKM LBKM **/
#define CAN1_BTR_LBKM		(1 << 30)

#define CAN1_BTR_SJW_SHIFT		24
#define CAN1_BTR_SJW_MASK		0x03
/** @defgroup can1_btr_sjw SJW SJW
@{*/
/**@}*/


#define CAN1_BTR_TS2_SHIFT		20
#define CAN1_BTR_TS2_MASK		0x07
/** @defgroup can1_btr_ts2 TS2 TS2
@{*/
/**@}*/


#define CAN1_BTR_TS1_SHIFT		16
#define CAN1_BTR_TS1_MASK		0x0f
/** @defgroup can1_btr_ts1 TS1 TS1
@{*/
/**@}*/


#define CAN1_BTR_BRP_SHIFT		0
#define CAN1_BTR_BRP_MASK		0x3ff
/** @defgroup can1_btr_brp BRP BRP
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_ti0r TI0R TX mailbox identifier register
@{*/


#define CAN1_TI0R_STID_SHIFT		21
#define CAN1_TI0R_STID_MASK		0x7ff
/** @defgroup can1_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN1_TI0R_EXID_SHIFT		3
#define CAN1_TI0R_EXID_MASK		0x3ffff
/** @defgroup can1_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_TI0R_IDE IDE **/
#define CAN1_TI0R_IDE		(1 << 2)
/** CAN1_TI0R_RTR RTR **/
#define CAN1_TI0R_RTR		(1 << 1)
/** CAN1_TI0R_TXRQ TXRQ **/
#define CAN1_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can1_tdt0r TDT0R mailbox data length control and time stamp register
@{*/


#define CAN1_TDT0R_TIME_SHIFT		16
#define CAN1_TDT0R_TIME_MASK		0xffff
/** @defgroup can1_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN1_TDT0R_TGT TGT **/
#define CAN1_TDT0R_TGT		(1 << 8)

#define CAN1_TDT0R_DLC_SHIFT		0
#define CAN1_TDT0R_DLC_MASK		0x0f
/** @defgroup can1_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_tdl0r TDL0R mailbox data low register
@{*/


#define CAN1_TDL0R_DATA3_SHIFT		24
#define CAN1_TDL0R_DATA3_MASK		0xff
/** @defgroup can1_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_TDL0R_DATA2_SHIFT		16
#define CAN1_TDL0R_DATA2_MASK		0xff
/** @defgroup can1_tdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_TDL0R_DATA1_SHIFT		8
#define CAN1_TDL0R_DATA1_MASK		0xff
/** @defgroup can1_tdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_TDL0R_DATA0_SHIFT		0
#define CAN1_TDL0R_DATA0_MASK		0xff
/** @defgroup can1_tdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_tdh0r TDH0R mailbox data high register
@{*/


#define CAN1_TDH0R_DATA7_SHIFT		24
#define CAN1_TDH0R_DATA7_MASK		0xff
/** @defgroup can1_tdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_TDH0R_DATA6_SHIFT		16
#define CAN1_TDH0R_DATA6_MASK		0xff
/** @defgroup can1_tdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_TDH0R_DATA5_SHIFT		8
#define CAN1_TDH0R_DATA5_MASK		0xff
/** @defgroup can1_tdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_TDH0R_DATA4_SHIFT		0
#define CAN1_TDH0R_DATA4_MASK		0xff
/** @defgroup can1_tdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_ti1r TI1R mailbox identifier register
@{*/


#define CAN1_TI1R_STID_SHIFT		21
#define CAN1_TI1R_STID_MASK		0x7ff
/** @defgroup can1_ti1r_stid STID STID
@{*/
/**@}*/


#define CAN1_TI1R_EXID_SHIFT		3
#define CAN1_TI1R_EXID_MASK		0x3ffff
/** @defgroup can1_ti1r_exid EXID EXID
@{*/
/**@}*/

